#
# https://github.com/Homebrew/homebrew-bundle
#
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'motemen/ghq'   # for ghq
tap 'peco/peco'     # for peco
tap 'fukajun/cask'  # for trailer-fix

#
# brew
brew 'git'
brew 'imagemagick'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-default-gems'
brew 'phantomjs'
brew 'readline'
brew 'openssl'
# for gihub
brew 'hub'
# for node
brew 'nodejs'
# for compile
brew 'gcc'
  brew 'cloog'
  brew 'gmp'
  brew 'isl'
  brew 'libmpc'
  brew 'mpfr'
# for database
brew 'postgresql'
  brew 'autoconf'
  brew 'pkg-config'
brew 'mysql'
# for webkit
brew 'qt4'
# for libv8 gem
brew 'v8'
# fav
brew 'zsh'
  brew 'gdbm'
brew 'wget'
brew 'tmux'
  brew 'qt'
  brew 'node'
  brew 'libevent'
brew 'vim'
brew 'go'
brew 'ag'
  brew 'pcre'
  brew 'the_silver_searcher'
  brew 'xz'
brew 'ghq'
brew 'peco'
# for heroku
brew 'heroku-toolbelt'
# for cask
brew 'brew-cask'

#
# cask
# dev
cask 'github'
cask 'google-chrome'
cask 'google-hangouts'
cask 'slack'
cask 'cyberduck'
cask 'skype'
cask 'firefox'
# fav
cask 'popclip'
cask 'growlnotify'
cask 'keyboard-cleaner'
cask 'sequel-pro'
cask 'trailer-fix'
cask 'evernote'
cask 'atom'
cask 'google-japanese-ime'
cask 'karabiner'
cask 'dropbox'
cask 'box-sync'
cask 'iterm2'
cask 'bettertouchtool'
cask 'night-owl'         # yorufukurou
cask 'keepassx'          # for manage account and password
cask 'hyperswitch'       # windows like window switch
cask 'imageoptim'        # compress image
cask 'clipmenu'          # clipboard extend
#cask 'dash'     # install from app store because license
#cask 'notestab' # install from app store
#cask 'display-menu' # https://itunes.apple.com/jp/app/display-menu/id549083868?mt=12
#cask 'Pomodoro Time' # https://itunes.apple.com/jp/app/pomodoro-time-focus-timer/id973134470?l=en&mt=12
