#
# https://github.com/Homebrew/homebrew-bundle
#
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'motemen/ghq'   # for ghq
tap 'peco/peco'     # for peco
tap 'fukajun/cask'  # for trailer-fix

#
# brew
brew 'git'
brew 'imagemagick'
brew 'nodejs'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-default-gems'
brew 'phantomjs'
brew 'readline'
brew 'openssl'
# for database
brew 'postgresql'
brew 'mysql'
# for webkit
brew 'qt4'
# fav
brew 'tmux'
  brew 'qt'
  brew 'node'
  brew 'libevent'
brew 'vim'
brew 'go'
brew 'ag'
  brew 'pcre'
  brew 'the_silver_searcher'
  brew 'xz'
brew 'ghq'
brew 'peco'
# tempolary
brew 'sha256sum'
# for cask
brew 'brew-cask'

#
# cask
cask 'github'
cask 'google-chrome'
cask 'google-hangouts'
cask 'slack'
# fav
cask 'trailer-fix'
cask 'atom'
cask 'google-japanese-ime'
cask 'karabiner'
cask 'dropbox'
cask 'iterm2'
cask 'bettertouchtool'
cask 'night-owl' # yorufukurou
cask 'keepassx'
cask 'hyperswitch'
cask 'imageoptim'
